uhnp/src/InformationRegisters/ПереторжкаЗакупок/ПереторжкаЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПереторжкаЗакупок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПереторжки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗакупочнаяПроцедура</name>
    <type>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПереторжкаЗакупок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Возвращает актуальный номер переторжки по закупке ЗакупкаВход.
Функция ПолучитьАктуальныйНомерПереторжки(ЗакупкаВход) Экспорт
	РезультатФункции = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереторжкаЗакупокСрезПоследних.ЗакупочнаяПроцедура КАК ЗакупочнаяПроцедура,
		|	ПереторжкаЗакупокСрезПоследних.НомерПереторжки КАК НомерПереторжки
		|ИЗ
		|	РегистрСведений.ПереторжкаЗакупок.СрезПоследних КАК ПереторжкаЗакупокСрезПоследних
		|ГДЕ
		|	ПереторжкаЗакупокСрезПоследних.ЗакупочнаяПроцедура = &ЗакупочнаяПроцедура";
	Запрос.УстановитьПараметр("ЗакупочнаяПроцедура", ЗакупкаВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатФункции = ВыборкаДетальныеЗаписи.НомерПереторжки;
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		 //	ПолучитьАктуальныйНомерПереторжки()
	
#КонецЕсли
